[
  {
    "title": "Penn hacker claims to have stolen 1.2 million donor records in data breach",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-hacker-claims-1.2-million-donor-data-breach/",
    "author": "Lawrence Abrams",
    "published": "November 2, 2025",
    "summary": "A hacker has taken responsibility for last week's University of Pennsylvania \"We got hacked\" email incident, saying it was a far more extensive breach that exposed data on 1.2 million donors and internal documents. On Friday, University of Pennsylvania alumni and students began receiving multiple offensive emails from Penn.edu addresses claiming the university had been hacked and data stolen. \"The University of Pennsylvania is a dog**** elitist institution full of woke retards. We have terrible security practices and are completely unmeritocratic,\" reads the email sent to Penn alumni and students. \"We hire and admit morons because we love legacies, donors, and unqualified affirmative action admits. We love breaking federal laws like FERPA (all your data will be leaked) and Supreme Court rulings like SFFA.\" BleepingComputer confirmed the emails originated from connect.upenn.edu, a Penn mailing list platform hosted on Salesforce Marketing Cloud. The university downplayed the incident, describing the messages as \"fraudulent emails\" that were \"obviously fake.\" However, the threat actor behind the attack contacted BleepingComputer, claiming the intrusion was far broader and that they had gained access to multiple university systems. The hacker said their group \"gained full access\" to an employee's PennKey SSO account, allowing access to Penn's VPN, Salesforce data, Qlik analytics platform, SAP business intelligence system, and SharePoint files. They said they exfiltrated data for roughly 1.2 million students, alumni, and donors, including names, dates of birth, addresses, phone numbers, estimated net worth, donation history, and demographic details such as religion, race, and sexual orientation. The threat actors shared screenshots and data samples with BleepingComputer and posted them online to prove that they had indeed accessed these systems and stolen data from Penn. The attackers told BleepingComputer they breached Penn's systems on October 30th and completed data downloads by October 31st, when the compromised employee account was locked and access lost. After discovering their access had been revoked, the hacker said they still had access to Salesforce Marketing Cloud and used it to send the offensive mass email to roughly 700,000 recipients. When asked whether the credentials were stolen via an infostealer or phishing, the hacker declined to elaborate, saying the intrusion was simple and caused by Penn's security lapses. The hacker has since published a 1.7-GB archive containing spreadsheets, donation materials, and other files allegedly taken from Penn's SharePoint and Box systems. The attacker told BleepingComputer they were not extorting the university, saying, \"We don't think they'd pay, and we can extract plenty of value out of the data ourselves.\" When asked about their motivation, the hackers said the attack was not political but aimed at obtaining Penn's donor database. \"While we're not really politically motivated, we have no love for these nepobaby-serving institutions,\" the hackers told BleepingComputer. \"The main goal was their vast, wonderfully wealthy donor database.\" The donor database has not yet been leaked, though the threat actors claim they may release it in a month or two. When contacted with these claims, the University of Pennsylvania told BleepingComputer, \"We are continuing to investigate.\" After publishing this story, The Daily Pennsylvanian reported that Penn has referred the security incident to the FBI. \"We understand and share our community’s concerns and have reported this to the FBI. We are working with law enforcement as well as other third-party technical resources to address this as rapidly as possible,\" stated a Penn spokesperson. With a large amount of donor data now exposed, Penn donors should stay vigilant against targeted phishing or social engineering attempts. Attackers could use the stolen information to impersonate the university, solicit fraudulent donations, or gain access to donor credentials to breach their online accounts. Recipients should treat unexpected messages about donations with suspicion and verify their legitimacy directly with Penn before responding. As MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe. This free cheat sheet outlines 7 best practices you can start using today. University of Pennsylvania confirms data stolen in cyberattack ‘We got hacked’ emails threaten to leak University of Pennsylvania data Advertising giant Dentsu reports data breach at subsidiary Merkle FinWise data breach shows why encryption is your last defense F5 says hackers stole undisclosed BIG-IP flaws, source code",
    "similarity": 0.472095251083374
  },
  {
    "title": "Google disputes false claims of massive Gmail data breach",
    "url": "https://www.bleepingcomputer.com/news/security/google-disputes-false-claims-of-massive-gmail-data-breach/",
    "author": "Lawrence Abrams",
    "published": "October 27, 2025",
    "summary": "Google was once again forced to announce that it had not suffered a data breach after numerous news outlets published sensational stories about a fake breach that purportedly exposed 183 million accounts. This claim began over the weekend and into today, with news stories claiming that millions of Gmail accounts were breached, with some outlets saying it affected the full 183 million accounts. However, as the company explained in a series of posts on Monday, Gmail did not suffer a breach, and the compromised accounts were actually from a compilation of credentials stolen by information-stealing malware and other attacks over the years. \"Reports of a 'Gmail security breach impacting millions of users' are false. Gmail's defenses are strong, and users remain protected,\" reads a post on X . \"The inaccurate reports are stemming from a misunderstanding of infostealer databases, which routinely compile various credential theft activity occurring across the web. It's not reflective of a new attack aimed at any one person, tool, or platform.\" \"Several inaccurate claims surfaced recently that incorrectly stated that we issued a broad warning to all Gmail users about a major Gmail security issue. This is entirely false,\" Google added. This is just the latest such story that numerous news websites and cybersecurity companies have reported without verification in recent years. This particular story stems from Have I Been Pwned (HIBP) creator Troy Hunt announcing he recently added a massive collection of 183 million compromised credentials to the data breach notification platform shared by the threat intelligence platform Synthient. These credentials were not stolen in a single data breach, but rather through information-stealing malware, data breaches, credential stuffing, and phishing. Furthermore, these accounts are not for a single platform but for thousands, if not millions, of sites. Threat actors commonly collect exposed credentials and combine them into massive collections, which are then shared among the cybercrime community on Telegram channels, Discord servers, and hacking forums. After loading the data into HIBP, Hunt says 91% of the 183 million credentials had previously been seen, illustrating that many of them have been circulating for years. \"The final number once the entire data set was loaded into HIBP was 91% pre-existing, with 16.4M previously unseen addresses in any data breach, not just stealer logs,\" explained Hunt. Companies, including Google, commonly use collections like these to warn customers of exposed passwords and to force password resets to protect accounts. \"Gmail takes action when we spot large batches of open credentials, helping users reset passwords and resecure accounts,\" explained Google. While the claims of a Gmail data breach are false, that does not mean exposed credentials are harmless or should be ignored, as threat actors commonly use them to breach corporate networks and carry out devastating attacks. For example, the UnitedHealth Change Healthcare ransomware attack was caused by exposed Citrix credentials that enabled threat actors to gain initial network access. However, reports of unfounded data breaches do not help anyone and only cause undue stress and extra work for a platform's users and business customers. Just last month, Google had to state that it did not suffer a data breach after the same news sites claimed that 2.5 billion Gmail accounts had been compromised . While that claim stemmed from a Salesloft breach that impacted a small number of Google Workspace accounts , the story was quickly sensationalized into a much larger breach. If you are concerned that your credentials may have been part of the Synthient collection, you can register an account at Have I Been Pwned , open the dashboard, and click Stealer Logs to see if your account was compromised in the past by information-stealing malware. If you have accounts listed, perform an antivirus scan on your computer, then immediately change the passwords for all of your accounts. As MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe. This free cheat sheet outlines 7 best practices you can start using today. Have I Been Pwned: Prosper data breach impacts 17.6 million accounts Gmail business users can now send encrypted emails to anyone Plex tells users to reset passwords after new data breach Leak confirms Google Gemini 3 Pro and Nano Banana 2 could launch soon Hyundai AutoEver America data breach exposes SSNs, drivers licenses",
    "similarity": 0.49858877062797546
  },
  {
    "title": "FinWise data breach shows why encryption is your last defense",
    "url": "https://www.bleepingcomputer.com/news/security/finwise-data-breach-shows-why-encryption-is-your-last-defense/",
    "author": "Home",
    "published": "October 22, 2025",
    "summary": "The 2024 FinWise data breach serves as a stark example of the growing insider threats faced by modern financial institutions. Unlike typical cyberattacks originating from external hackers, this incident stemmed from unauthorized access by a former employee using retained credentials. On May 31, 2024, the ex-employee accessed FinWise Bank’s systems after leaving the company and leaked sensitive personal information belonging to 689,000 customers of American First Finance (AFF). Even more alarming, this unauthorized access went undetected for more than a year before being discovered by the bank on June 18, 2025. The most troubling aspect of the case lies in the time gap between the initial breach and its discovery. FinWise Bank only became aware of the incident and notified affected customers in June 2025 which was over a year after the breach occurred. Lawsuits allege that the stolen data may not have been adequately encrypted and secured, causing public criticism and concern. Security experts emphasize that a well-designed information protection framework must not only encrypt critical financial data but also proactively detect and prevent abnormal access attempts. FinWise Bank’s failure to implement such basic safeguards, coupled with potentially poor encryption practices, has led the institution to face legal action and heightened scrutiny from regulators and customers alike. Although FinWise has yet to issue an official statement regarding its encryption practices, the data breach will result in irreversible damage to both the company and its customers. In incidents like the FinWise breach, encryption serves as the last line of defense for data. However, true data protection goes beyond encryption alone; it also requires key management and access control measures. If FinWise properly implemented and managed its data encryption systems, the exposure of customers’ personal information could have been prevented even after the breach. Moreover, effective key management could have lowered the risk of data misuse, safeguarding sensitive information from further exploitation. Prevent data misuse after cyber attacks. D.AMO combines encryption, key management, and centeralized control to protect your organization’s most sensitive data. In response to data breaches like the one at FinWise, Penta Security’s D.AMO (Encryption Platform) has drawn renewed attention as an effective countermeasure. More than just a data encryption tool, D.AMO is a comprehensive data security platform that integrates powerful encryption, granular access control, and an independent key management system (KMS). Launched in 2004 as South Korea’s first packaged encryption solution and a pioneering product among global leaders, D.AMO has since established itself as a trusted name in the industry. With over 10,000 clients across finance, public, and enterprise sectors, D.AMO’s long-standing experience and proven technology have solidified its position as a leading force in the database encryption market. D.AMO has established itself as the No. 1 data encryption solution in South Korea’s public sector, recognized for its robust cybersecurity infrastructure and specialized expertise. Trusted by government institutions and major enterprises alike, it leads the market with unmatched reliability and technological depth. The platform supports multiple encryption methods, including API-based, plug-in-based, and kernel-level encryption, ensuring flexible deployment across both new implementations and live service environments. Going further, D.AMO enables selective column-level encryption based on data sensitivity, minimizing performance degradation while maintaining full compatibility across all layers of a customer’s system environment. In high-traffic sectors such as finance and government, service continuity is critical. D.AMO ensures that search and operational functions remain intact even after encryption, allowing organizations to achieve both operational efficiency and strong data protection. This balance of performance and security has made us the preferred choice for countless public institutions and large-scale enterprises. While encryption itself can prevent the misuse of sensitive information in the event of a data breach, effective key management is equally critical. The strength of any data encryption strategy is directly proportional to the security of its key management system. D.AMO KMS is a dedicated hardware appliance designed to securely manage encryption keys independently from the data they protect. By separating the privileges of database administrators and security administrators, D.AMO KMS ensures that even those with access to encrypted data cannot access the corresponding keys. This separation of duties serves as one of the most effective defenses against insider threats, such as the FinWise data breach. Furthermore, because D.AMO KMS stores keys in a physically and logically isolated appliance, encrypted data remains protected even if a hacker or insider were to gain full access to the database. Without the decryption keys, the stolen data remains unusable—providing a powerful safeguard against both internal and external breaches. D.AMO Control Center enables centralized management and access control for all encryption products deployed across every layer of a customer’s internal server infrastructure. Through this unified management system, administrators can monitor logs generated by each product and efficiently operate encryption solutions within a single, integrated interface. Incidents like the FinWise data breach underscore the critical importance of user access privileges in preventing insider threats. D.AMO Control Center addresses this challenge by providing granular privilege management, including user account separation, encryption/decryption permission settings, and data access control. By enforcing strict role-based access policies, organizations can proactively defend against potential insider misuse and strengthen overall data security governance. The FinWise data breach was not merely a technical incident, but a systemic failure rooted in inadequate security governance and potentially insufficient encryption and centralized management. This case highlights the growing need for financial institutions to adopt robust defense strategies—not only against external attacks, but also against unpredictable insider threats. Penta Security’s D.AMO provides a comprehensive solution to these challenges. Designed to meet global compliance standards such as PCI-DSS, GDPR, ITSCC, CCPA, and CPRA, D.AMO integrates data encryption (D.AMO), a dedicated key management system (D.AMO KMS), and centralized management (D.AMO Control Center) into a single, unified platform. Through its advanced audit and logging features, D.AMO detects potential data theft resulting from privilege abuse, and even in cases of internal access, its robust encryption and strict key management render the exposed data useless. An analysis of the FinWise breach shows that D.AMO directly addresses every vulnerability revealed in the incident. Organizations must shift their approach to data security from reactive response to proactive prevention. For any institution handling sensitive information, adopting an integrated encryption platform like D.AMO is no longer optional. Data encryption is a critical investment in the future of secure data management. > Download D.AMO White Paper to Learn More . Sponsored and written by Penta Security .",
    "similarity": 0.5044211745262146
  },
  {
    "title": "Have I Been Pwned: Prosper data breach impacts 17.6 million accounts",
    "url": "https://www.bleepingcomputer.com/news/security/have-i-been-pwned-warns-of-prosper-data-breach-impacting-176-million-accounts/",
    "author": "Sergiu Gatlan",
    "published": "October 16, 2025",
    "summary": "Hackers stole the personal information of over 17.6 million people after breaching the systems of financial services company Prosper. Prosper operates as a peer-to-peer lending marketplace that has helped over 2 million customers secure more than $30 billion in loans since its founding in 2005. As the company disclosed one month ago on a dedicated page, the breach was detected on September 2, but Prosper has yet to find evidence that the attackers gained access to customer accounts and funds. However, the attackers stole data belonging to Prosper customers and loan applicants. The company hasn't shared what information was exposed beyond Social Security numbers because it's still investigating what data was affected. Prosper added that the security breach didn't impact its customer-facing operations and that it has reported the incident to relevant authorities and is collaborating with law enforcement to investigate the attack. \"We have evidence that confidential, proprietary, and personal information, including Social Security Numbers, was obtained, including through unauthorized queries made on Company databases that store customer information and applicant data. We will be offering free credit monitoring as appropriate after we determine what data was affected,\" the company says. \"The investigation is still in its very early stages, but resolving this incident is our top priority and we are committed to sharing additional information with our customers as appropriate.\" While Prosper didn't share how many customers were affected by this data breach, data breach notification service Have I Been Pwned revealed the extent of the incident on Thursday, reporting that it affected 17.6 million unique email addresses. The stolen information also includes customers' names, government-issued IDs, employment status, credit status, income levels, dates of birth, physical addresses, IP addresses, and browser user agent details. When BleepingComputer reached out to Prosper with questions about the incident, a spokesperson said the company is aware of Have I Been Pwned's report but \"is not able to validate\" it. \"The investigation to determine what data was affected and to whom it belongs remains ongoing. We will be offering free credit monitoring as appropriate after we determine what data was affected,\" the Prosper spokesperson added. Whether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start. Get the cheat sheet and take the guesswork out of secrets management. Google disputes false claims of massive Gmail data breach Hyundai AutoEver America data breach exposes SSNs, drivers licenses SonicWall says state-sponsored hackers behind September security breach University of Pennsylvania confirms data stolen in cyberattack Data breach at major Swedish software supplier impacts 1.5 million",
    "similarity": 0.45661062002182007
  }
]